project/tests/endurance-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 1800  # 30 minutes
      arrivalRate: 30
      name: "Sustained Load"
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./test-functions.js"

scenarios:
  - name: "Long Duration User Flow"
    flow:
      - loop:
        - post:
            url: "/api/auth/login"
            name: "Endurance Login"
            json:
              username: "user{{ $randomInt(1, 100) }}"
              password: "password123"
            capture:
              - json: "$.token"
                as: "authToken"
        - get:
            url: "/api/products"
            name: "Endurance Product Browse"
            qs:
              page: "{{ $randomInt(1, 5) }}"
        - post:
            url: "/api/cart"
            name: "Endurance Cart Add"
            headers:
              Authorization: "Bearer {{ authToken }}"
            json:
              productId: "prod_{{ $randomInt(1, 1000) }}"
              quantity: 1
        - think: 5
        count: 100