project/tests/load-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Normal load"
    - duration: 180
      arrivalRate: 50
      name: "Peak load"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./test-functions.js"

scenarios:
  - name: "User Registration and Shopping Flow"
    weight: 40
    flow:
      - post:
          url: "/api/auth/register"
          name: "Register User"
          json:
            username: "{{ $randomString() }}"
            email: "{{ $randomString() }}@example.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/products"
          name: "Browse Products"
          qs:
            page: "{{ $randomInt(1, 5) }}"
            limit: 20
      - get:
          url: "/api/products/prod_{{ $randomInt(1, 100) }}"
          name: "View Product Details"
      - post:
          url: "/api/cart"
          name: "Add to Cart"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            productId: "prod_{{ $randomInt(1, 100) }}"
            quantity: "{{ $randomInt(1, 3) }}"
      - get:
          url: "/api/cart"
          name: "View Cart"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Existing User Login and Purchase"
    weight: 35
    flow:
      - post:
          url: "/api/auth/login"
          name: "User Login"
          json:
            username: "user{{ $randomInt(1, 100) }}"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/products"
          name: "Browse Products"
          qs:
            category: "{{ $pick(['Electronics', 'Clothing', 'Books', 'Home']) }}"
            sort: "{{ $pick(['price_asc', 'price_desc', 'rating']) }}"
      - loop:
        - post:
            url: "/api/cart"
            name: "Add Multiple Items"
            headers:
              Authorization: "Bearer {{ authToken }}"
            json:
              productId: "prod_{{ $randomInt(1, 1000) }}"
              quantity: "{{ $randomInt(1, 2) }}"
        count: "{{ $randomInt(2, 5) }}"
      - post:
          url: "/api/orders"
          name: "Place Order"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/orders"
          name: "View Order History"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Product Search and Browse"
    weight: 20
    flow:
      - get:
          url: "/api/products"
          name: "Search Products"
          qs:
            search: "{{ $pick(['Product', 'quality', 'excellent', 'features']) }}"
            page: "{{ $randomInt(1, 10) }}"
      - get:
          url: "/api/products"
          name: "Filter by Category"
          qs:
            category: "{{ $pick(['Electronics', 'Clothing', 'Books', 'Home']) }}"
            limit: 50
      - loop:
        - get:
            url: "/api/products/prod_{{ $randomInt(1, 1000) }}"
            name: "Browse Product Details"
        count: "{{ $randomInt(3, 8) }}"

  - name: "Analytics Dashboard Access"
    weight: 5
    flow:
      - post:
          url: "/api/auth/login"
          name: "Admin Login"
          json:
            username: "user1"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/analytics"
          name: "Load Analytics Dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/health"
          name: "Health Check"